Охотники_и_рыболовы/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/InformationRegisters/СотрудникиПользователя/СотрудникиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиПользователя</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/ChartsOfCharacteristicTypes/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>НастройкиПользователей</name>
  <type>
    <types>CatalogRef.Охотхозяйства</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Пользователи</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <predefined>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Основная организация</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Охотхозяйства</types>
      </type>
    </items>
    <items>
      <name>ОсновнойОтветственный</name>
      <description>Основной ответственный</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Охотники_и_рыболовы/src/Catalogs/Пользователи/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Программный интерфейс объекта реализован через ДополнительныеСвойства:
//
// ОписаниеПользователяИБ - Структура со свойствами:
//   Действие - Строка - "Записать" или "Удалить".
//      1. Если Действие = "Удалить" другие свойства не требуются. Удаление
//      будет считаться успешным и в том случае, когда пользовательИБ
//      не найден по значению реквизита ИдентификаторПользователяИБ.
//      2. Если Действие = "Записать", тогда будет создан или обновлен
//      пользователь ИБ по указанным свойствам.
//
//   ВходВПрограммуРазрешен - Неопределено - вычислить автоматически:
//                            если вход в программу запрещен, тогда остается запрещен,
//                            иначе остается разрешен, кроме случая, когда
//                            все виды аутентификации установлены в Ложь.
//                          - Булево - если Истина, тогда установить аутентификацию, как
//                            указана или сохранена в значениях одноименных реквизитов;
//                            если Ложь, тогда снять все виды аутентификации у пользователя ИБ.
//                          С свойство не указано - прямая установка сохраняемых и
//                            действующих видов аутентификации (для поддержки обратной совместимости).
//
//   АутентификацияСтандартная, АутентификацияОС, АутентификацияOpenID - установить
//      сохраняемые значения видов аутентификации и, в зависимости от использования свойства.
//      ВходВПрограммуРазрешен, установить действующие значения видов аутентификации.
// 
//   Остальные свойства.
//      Состав остальных свойств указывается аналогично составу свойств параметра.
//      ОбновляемыеСвойства для процедуры Пользователи.ЗаписатьПользователяИБ(),
//      кроме свойства ПолноеИмя - устанавливается по Наименованию.
//
//      Для сопоставления существующего свободного пользователя ИБ с пользователем в справочнике,
//      с которым не сопоставлен другой существующий пользователь ИБ, нужно вставить свойство.
//      УникальныйИдентификатор. Если указать идентификатор пользователя ИБ, который
//      сопоставлен с текущим пользователем, ничего не изменится.
//
//   При выполнении действий "Записать" и "Удалить" реквизит объекта.
//   ИдентификаторПользователяИБ обновляется автоматически, его не следует изменять.
//
//   После выполнения действия в структуру вставляются (обновляются) следующие свойства:
//   - РезультатДействия - Строка, содержащая одно из значений:
//       "ДобавленПользовательИБ", "ИзмененПользовательИБ", "УдаленПользовательИБ",
//       "ОчищеноСопоставлениеСНесуществующимПользователемИБ", "НеТребуетсяУдалениеПользовательИБ".
//   - УникальныйИдентификатор - УникальныйИдентификатор пользователя ИБ.

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

Перем ПараметрыОбработкиПользователяИБ; // Параметры, заполняемые при обработке пользователя ИБ.
                                        // Используются в обработчике события ПриЗаписи.

Перем ЭтоНовый; // Показывает, что был записан новый объект.
                // Используются в обработчике события ПриЗаписи.

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	
	ОхотаСлужебный.НачатьОбработкуПользователяИБ(ЭтотОбъект, ПараметрыОбработкиПользователяИБ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Пользователь = ЭтотОбъект.Ссылка;
	//Если ДополнительныеСвойства.Свойство("ГруппаНовогоПользователя")
	//	И ЗначениеЗаполнено(ДополнительныеСвойства.ГруппаНовогоПользователя) Тогда
	//	
	//	Блокировка = Новый БлокировкаДанных;
	//	ЭлементБлокировки = Блокировка.Добавить("Справочник.ГруппыПользователей");
	//	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//	Блокировка.Заблокировать();
	//	
	//	ОбъектГруппы = ДополнительныеСвойства.ГруппаНовогоПользователя.ПолучитьОбъект();
	//	ОбъектГруппы.Состав.Добавить().Пользователь = Ссылка;
	//	ОбъектГруппы.Записать();
	//КонецЕсли;
	
	// Обновление состава автоматической группы "Все пользователи".
	УчастникиИзменений = Новый Соответствие;
	ИзмененныеГруппы   = Новый Соответствие;
	
	//ПользователиСлужебный.ОбновитьСоставыГруппПользователей(
	//	Справочники.ГруппыПользователей.ВсеПользователи, Ссылка, УчастникиИзменений, ИзмененныеГруппы);
	//
	//ПользователиСлужебный.ОбновитьИспользуемостьСоставовГруппПользователей(
	//	Ссылка, УчастникиИзменений, ИзмененныеГруппы);
	
	ОхотаСлужебный.ЗавершитьОбработкуПользователяИБ(
		ЭтотОбъект, ПараметрыОбработкиПользователяИБ);
		
		
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СвязатьПользователяССотрудником(Пользователь);
	
	//ПользователиСлужебный.ПослеОбновленияСоставовГруппПользователей(
	//	УчастникиИзменений, ИзмененныеГруппы);
	
	//ПользователиСлужебный.ПослеДобавленияИзмененияПользователяИлиГруппы(Ссылка, ЭтоНовый);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеДействияПередУдалениемВОбычномРежимеИПриОбменеДанными();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДополнительныеСвойства.Вставить("ЗначениеКопирования", ОбъектКопирования.Ссылка);
	
	ИдентификаторПользователяИБ = Неопределено;
	ИдентификаторПользователяСервиса = Неопределено;
	Подготовлен = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Только для внутреннего использования.
Процедура ОбщиеДействияПередУдалениемВОбычномРежимеИПриОбменеДанными() Экспорт
	
	// Требуется удалить пользователя ИБ, иначе он попадет в список ошибок в форме ПользователиИБ,
	// кроме того, вход под этим пользователем ИБ приведет к ошибке.
	
	ОписаниеПользователяИБ = Новый Структура;
	ОписаниеПользователяИБ.Вставить("Действие", "Удалить");
	ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	
	ОхотаСлужебный.НачатьОбработкуПользователяИБ(ЭтотОбъект, ПараметрыОбработкиПользователяИБ, Истина);
	ОхотаСлужебный.ЗавершитьОбработкуПользователяИБ(ЭтотОбъект, ПараметрыОбработкиПользователяИБ);
	
КонецПроцедуры

Процедура СвязатьПользователяССотрудником(Пользователь) Экспорт
	
	Если Пользователь.Недействителен 
		ИЛИ Пользователь.Служебный Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаСвязанныхПользователей = ПолучитьСотрудниковПользователя(Пользователь);
	
	Если ТаблицаСвязанныхПользователей.Количество() = 0 Тогда
		
		НайденныйПользователь = Справочники.Сотрудники.НайтиПоНаименованию(Пользователь.Наименование, Истина);
		Если ЗначениеЗаполнено(НайденныйПользователь) Тогда
			
			Сотрудник = НайденныйПользователь;
			
		Иначе
			
			элСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
			
			элСотрудник.Наименование = Пользователь.Наименование;
			
			Организация = ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,"ОсновнаяОрганизация");
			
			Если НЕ Организация.Пустая() Тогда
				элСотрудник.Организация = Организация;
			КонецЕсли;	
			
			
			
			Попытка
				элСотрудник.Записать();
			Исключение
				 Возврат;
			КонецПопытки;
			
				Сотрудник = элСотрудник.Ссылка;
			
		КонецЕсли;
		
		// Если элемент не записан, Сотрудник = Неопределено;
		Если ЗначениеЗаполнено(Сотрудник) Тогда
		
			СоответствиеДанных = Новый Соответствие();
			СоответствиеДанных.Вставить(Сотрудник, Пользователь);
			
			РегистрыСведений.СотрудникиПользователя.ДобавитьСотрудниковПользователей(СоответствиеДанных);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Сотрудник = ТаблицаСвязанныхПользователей[0].Сотрудник;
		
	КонецЕсли;
	
	УстановитьОсновногоОтветственногоДляПользователя(Сотрудник, Пользователь);
	
КонецПроцедуры


Функция ПолучитьСотрудниковПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос("Выбрать ПЕРВЫЕ 1 * Из РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя Где СотрудникиПользователя.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Новый ТаблицаЗначений, РезультатЗапроса.Выгрузить());
	
КонецФункции // ПолучитьСотрудниковПользователя()

Процедура УстановитьОсновногоОтветственногоДляПользователя(НовыйОсновнойОтветственный, Пользователь, ОбновитьЗначениеНастройки = Ложь) Экспорт
	
	// Установим настройку, если пользователю не назначен ответственный
	ОсновнойОтветственный = ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
	Если (ЗначениеЗаполнено(ОсновнойОтветственный)
		И ОбновитьЗначениеНастройки)
			ИЛИ НЕ ЗначениеЗаполнено(ОсновнойОтветственный) Тогда
		
		ОбщегоНазначения.УстановитьНастройку("ОсновнойОтветственный", Пользователь,НовыйОсновнойОтветственный);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, Настройка) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	|
	|ГДЕ
	|	Пользователь = &Пользователь
	| И Настройка    = &Настройка";

	Выборка = Запрос.Выполнить().Выбрать();

	ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();

	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;

	ИначеЕсли Выборка.Следующий() Тогда

		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;

	Иначе
		Возврат ПустоеЗначение;

	КонецЕсли;

КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()


#КонецОбласти

#КонецЕсли
